"""
3. Написать функцию host_range_ping_tab(), возможности которой основаны на функции из примера 2.
Но в данном случае результат должен быть итоговым по всем ip-адресам, представленным в
табличном формате (использовать модуль tabulate). Таблица должна состоять из двух колонок и
выглядеть примерно так:
Reachable
-------------
10.0.0.1
10.0.0.2

Unreachable
-------------
10.0.0.3
10.0.0.4
"""
from tabulate import tabulate

from task_2 import host_range_ping


def host_range_ping_tab():
    result_dict = host_range_ping()

    print(tabulate(result_dict, headers='keys', tablefmt='pipe', stralign='center'))


if __name__ == '__main__':
    host_range_ping_tab()

# RESULT
# 8.8.8.8 - Хост доступен
# 8.8.8.9 - Хост недоступен
# 8.8.8.10 - Хост недоступен
# 8.8.8.11 - Хост недоступен
# 8.8.8.12 - Хост недоступен
# |  Доступные узлы  |  Недоступные узлы  |
# |:----------------:|:------------------:|
# |     8.8.8.8      |      8.8.8.9       |
# |                  |      8.8.8.10      |
# |                  |      8.8.8.11      |
# |                  |      8.8.8.12      |
